In [29]:
import pandas as pd

columns = ['Emp_Id','Emp_Name','Dept','Salary']
Emp_Id = ['1','1','1','2','3','1']
Emp_Name = ['Ram','Ram','Ram','Shyam','Govind','Ram']
Dept = ['IT','IT','CS','IT','CS','IT']
Salary = ['50000','50000','60000','55000','52000','70000']
df = pd.DataFrame(list(zip(Emp_Id,Emp_Name,Dept,Salary)),columns = columns)
df

  Emp_Id Emp_Name Dept Salary
0      1      Ram   IT  50000
1      1      Ram   IT  50000
2      1      Ram   CS  60000
3      2    Shyam   IT  55000
4      3   Govind   CS  52000
5      1      Ram   IT  70000

In [30]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [31]:
df.Emp_Id.duplicated()

0    False
1     True
2     True
3    False
4    False
5     True
Name: Emp_Id, dtype: bool

In [32]:
df.Emp_Name.duplicated()

0    False
1     True
2     True
3    False
4    False
5     True
Name: Emp_Name, dtype: bool

In [33]:
df.Emp_Name.duplicated().sum()

3

In [34]:
df[df.Emp_Name.duplicated()]

  Emp_Id Emp_Name Dept Salary
1      1      Ram   IT  50000
2      1      Ram   CS  60000
5      1      Ram   IT  70000

In [35]:
df[~df.Emp_Name.duplicated()]

  Emp_Id Emp_Name Dept Salary
0      1      Ram   IT  50000
3      2    Shyam   IT  55000
4      3   Govind   CS  52000

In [36]:
df.drop_duplicates()

  Emp_Id Emp_Name Dept Salary
0      1      Ram   IT  50000
2      1      Ram   CS  60000
3      2    Shyam   IT  55000
4      3   Govind   CS  52000
5      1      Ram   IT  70000

In [37]:
df.drop_duplicates(subset = ['Emp_Id'])

  Emp_Id Emp_Name Dept Salary
0      1      Ram   IT  50000
3      2    Shyam   IT  55000
4      3   Govind   CS  52000

In [38]:
df.drop_duplicates(subset = ['Emp_Id'],keep = 'last')

  Emp_Id Emp_Name Dept Salary
3      2    Shyam   IT  55000
4      3   Govind   CS  52000
5      1      Ram   IT  70000